performance-test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - flow:
      - post:
          url: '/api/auth/login'
          json:
            username: 'admin'
            password: 'test123'
          capture:
            - json: '$.access_token'
              as: 'token'